Repository: MetaModels/attribute_file
Catalog: src/Resources/translations/*_metamodel_dcasetting.*.xlf
Languages: de, fr

# upload_settings_legend
source: File upload settings
de: Einstellungen zum Upload von Dateien
fr: Paramètres de transfert de fichiers

# file_widgetMode.label
source: Widget mode
de: Widget-Modus
fr: Mode du widget

# file_widgetMode.description
source: With the mode the display type can be selected.
de: Mit dem Modus kann die Anzeigeart ausgewählt werden.
fr: Le mode permet de sélectionner le type d'affichage.

# fe_widget_file_doNotOverwrite.label
source: Preserve existing files
de: Vorhandene Dateien beibehalten
fr: Préserver les fichiers existants

# fe_widget_file_doNotOverwrite.description
source: Add a numeric suffix to the new file, if the file name already exists.
de: Fügen Sie der neuen Datei ein numerisches Suffix hinzu, wenn der Dateiname bereits existiert.
fr: Ajouter un suffixe numérique au nouveau fichier si le nom de fichier existe déjà.

# fe_widget_file_useHomeDir.label
source: Use home directory
de: Home-Verzeichnis verwenden
fr: Utiliser le répertoire personnel

# fe_widget_file_useHomeDir.description
source: If this option is active, store the file in the home directory if there is an authenticated user. If the target folder configured too and the user is authenticated, so this folder is the base upload folder.
de: Wenn diese Option aktiv ist, wird die Datei im Home-Verzeichnis gespeichert, wenn es einen authentifizierten Benutzer gibt. Ist der Zielordner zu konfiguriert und der Benutzer ist authentifiziert, so ist dieser Ordner der Basis-Upload-Ordner.
fr: Enregistrer le fichier dans le dossier personnel de l'utilisateur s'il s'est authentifié. Si le dossier cible est également configuré et que l'utilisateur est authentifié, ce dossier est le dossier de téléchargement de base.

# fe_widget_file_uploadFolder.label
source: Target folder
de: Zielordner
fr: Dossier cible

# fe_widget_file_uploadFolder.description
source: Please select the target folder from the files directory. If the home dir configured too and is not authenticated a user, so this folder is the base folder.
de: Bitte wählen Sie den Zielordner aus dem Dateiverzeichnis aus. Ist das Home-Verzeichnis konfiguriert und ein Benutzer nicht authentifiziert, so ist dieser Ordner der Basisordner.
fr: Sélectionner un dossier cible dans le répertoire des fichiers. Si un répertoire personnel est configuré mais que l'utilisateur n'est pas authentifié, ce dossier sera le dossier de base.

# fe_widget_file_extend_folder.label
source: Extend folder
de: Ordner erweitern

# fe_widget_file_extend_folder.description
source: Here you can extend the base upload folder path. The Contao insert tags are supported to extend the path.
de: Hier können Sie den Basis-Upload-Ordnerpfad erweitern. Die Contao Insert-Tags werden unterstützt, um den Pfad zu erweitern. Die Insert-Tags aus der Filterregel "Eigener SQL" funktionieren auch hier.

# fe_widget_file_deselect.label
source: Deselect file
de: Datei abwählen
fr: Désélectionner le fichier

# fe_widget_file_deselect.description
source: If this option deselect file is active, then that file entry is remove from this model.
de: Wenn die Option Datei abwählen aktiviert ist, wird dieser Dateieintrag aus diesem Modell entfernt.
fr: Si cette option est active, cette entrée de fichier sera supprimée de ce modèle.

# fe_widget_file_delete.label
source: Delete file
de: Datei löschen
fr: Supprimer le fichier

# fe_widget_file_delete.description
source: If this option delete file is active, then that file entry is remove from this model and from the file directory.
de: Ist die Option Datei löschen aktiv, so wird dieser Dateieintrag aus diesem Modell und aus dem Dateiverzeichnis entfernt.
fr: Si cette option est active, cette entrée de fichier sera supprimée de ce modèle et du dossier.

# fe_widget_file_normalize_extend_folder.label
source: Normalize extend folder
de: Erweiterten Ordner normalisieren

# fe_widget_file_normalize_extend_folder.description
source: Normalize the extend folder with an alias generator from the string util.
de: Normalisieren Sie den erweiterten Ordner mit einem Alias-Generator.

# fe_widget_file_normalize_filename.label
source: Normalize filename
de: Dateinamen normalisieren

# fe_widget_file_normalize_filename.description
source: Normalize the filename with an alias generator from the string util.
de: Normalisieren Sie den Dateinamen mit einem Alias-Generator.

# fe_widget_file_prefix_filename.label
source: Prefix filename
de: Dateinamen Präfix
fr: Préfixe de nom de fichier

# fe_widget_file_prefix_filename.description
source: Here you can prefix the filename. The Contao insert tags are supported to prefix the filename.
de: Hier können Sie Zeichen den Dateinamen vorangestellt werden. Die Contao-Insert-Tags werden für das Voranstellen des Dateinamens unterstützt.
fr: Ajouter un préfixe aux noms de fichiers. Les insert tags de Contao peuvent être utilisés.

# fe_widget_file_postfix_filename.label
source: Postfix filename
de: Dateinamen Postfix
fr: Suffixe de nom de fichier

# fe_widget_file_postfix_filename.description
source: Here you can postfix the filename. The Contao insert tags are supported to postfix the filename.
de: Hier können Sie Zeichen den Dateinamen anhängen. Die Contao-Insert-Tags werden für das Voranstellen des Dateinamens unterstützt.
fr: Ajouter un postfixe aux noms de fichiers. Les insert tags de Contao peuvent être utilisés.

# fe_widget_file_imageSize.label
source: Thumbnail width and height
de: Breite und Höhe der Vorschaubilder
fr: Hauteur et largeur de la vignette

# fe_widget_file_imageSize.description
source: Please enter either the image width, the image height or both measures to resize the image. If you leave both fields blank, the original image size will be displayed.
de: Bitte geben Sie entweder die Bildbreite, die Bildhöhe oder beides ein, damit das Bild skaliert wird. Falls Sie beide Felder leer lassen, wird das Bild in Originalgröße ausgegeben.
fr: Indiquer la largeur de l'image, sa hauteur ou les deux pour la redimensionner. Si les deux champs sont vides, l'image s'affichera à sa taille originale.

# fe_widget_file_sortBy.label
source: Order by
de: Sortieren nach
fr: Classer

# fe_widget_file_sortBy.description
source: Please choose the sort order.
de: Bitte wählen Sie die Sortierreihenfolge.
fr: Sélectionner l'ordre de classement.

# file_widgetModes.normal
source: Show files as list.
de: Dateien als Liste anzeigen.
fr: Afficher les fichiers en liste

# file_widgetModes.downloads
source: Show files as sortable file list e.g. for downloads.
de: Dateien als sortierbare Dateiliste anzeigen z.B. für Downloads.
fr: Afficher les fichiers sous forme de liste à classer (ex : pour des téléchargements)

# file_widgetModes.gallery
source: Show files as sortable images e.g. for gallery.
de: Dateien als sortierbare Bilder anzeigen z.B. für eine Galerie.
fr: Afficher les fichiers sous forme d'images à classer (ex : pour une galerie)

# file_widgetModes.fe_single_upload
source: Single file upload [only for frontend editing]
de: Einzelner Datei-Upload [nur für Frontend-Bearbeitung]
fr: Télécharger un fichier unique [réservé à l'édition en frontend]

# file_widgetModes.fe_single_upload_preview
source: Single file upload with show thumbnail [only for frontend editing]
de: Einzelner Datei-Upload mit Anzeige der Vorschaubilder [nur für Frontend-Bearbeitung]
fr: Télécharger un fichier unique avec la vignette [réservé à l'édition en frontend]

# file_widgetModes.fe_multiple_upload
source: Multiple file upload [only for frontend editing]
de: Mehrfacher Datei-Upload [nur für Frontend-Bearbeitung]
fr: Téléchargment multiple [pour l'édition en frontend]

# file_widgetModes.fe_multiple_upload_preview
source: Multiple file upload with show thumbnail [only for frontend editing]
de: Mehrfacher Datei-Upload mit Anzeige der Vorschaubilder [nur für Frontend-Bearbeitung]
fr: Téléchargment multiple avec vignette [pour l'édition en frontend]

# fe_widget_file_sortBy.name_asc
source: File name (ascending)
de: Dateiname (aufsteigend)
fr: Nom de fichier (ascendant)

# fe_widget_file_sortBy.name_desc
source: File name (descending)
de: Dateiname (absteigend)
fr: Nom de fichier (descendant)

# fe_widget_file_sortBy.date_asc
source: Date (ascending)
de: Datum (aufsteigend)
fr: Date (ascendante)

# fe_widget_file_sortBy.date_desc
source: Date (descending)
de: Datum (absteigend)
fr: Date (descendante)

# fe_widget_file_sortBy.random
source: Random order
de: Zufällige Reihenfolge
fr: Ordre aléatoire
