Repository: MetaModels/attribute_file
Catalog: src/Resources/translations/*_metamodel_rendersetting.*.xlf
Languages: de, fr

# file_showImage.label
source: Enable as image field with thumbnail
de: Als Bildfeld mit Vorschaubild benutzen
fr: Gérer comme image avec vignette

# file_showImage.description
source: If selected, a thumbnail will be created for image files.
de: Falls aktiviert, wird für das Bild ein verkleinertes Vorschaubild generiert.
fr: Cocher pour créer une vignette pour les fichiers image.

# file_sortBy.label
source: Order by
de: Sortierung nach
fr: Classer par

# file_sortBy.description
source: Please choose the sort order.
de: Bitte wählen Sie die Sortierreihenfolge.
fr: Choisir l'ordre de classement.

# file_showLink.label
source: Create link as file download or image lightbox
de: Link als Download oder Lightbox erstellen
fr: Créer un lien de téléchargement ou une image lightbox.

# file_showLink.description
source: Wraps the item in a link that will show the fullscreen image or download the file.
de: Das Item wird in einen Link eingebettet, der entweder für eine Großansicht oder einen Download dienen kann.
fr: Enveloppe l'élément dans un lien qui affichera l'image en plein écran ou téléchargera le fichier.

# file_imageSize.label
source: Image width and height
de: Bildbreite und -höhe
fr: Largeur et hauteur de l'image

# file_imageSize.description
source: Please enter either the image width, the image height or both measures to resize the image. If you leave both fields blank, the original image size will be displayed.
de: Bitte geben Sie entweder die Bildbreite, die Bildhöhe oder beides ein, damit das Bild skaliert wird. Falls Sie beide Felder leer lassen, wird das Bild in Originalgröße ausgegeben.
fr: Indiquer la largeur, la hauteur ou les deux pour redimensionner l'image. Si les deux sont vides, l'image sera affichée en taille originale.

# file_placeholder.label
source: Image placeholder
de: Bild als Platzhalter
fr: Image de remplacement

# file_placeholder.description
source: Select an image as a placeholder if no image is selected.
de: Wählen Sie ein Bild als Platzhalter, wenn kein Bild ausgewählt ist.
fr: Sélectionner une image de remplacement tant qu'aucune image n'est sélectionnée.

# file_protectedDownload.label
source: Protected download
de: Geschützter Download
fr: Téléchargement sécurisé

# file_protectedDownload.description
source: If this option is selected, the URL is only temporarily valid.
de: Wenn diese Option ausgewählt ist, ist die URL nur vorübergehend gültig.
fr: Si l'option est sélectionnée, l'url sera temporaire.

# file_sortBy.name_asc
source: File name (ascending)
de: Dateiname (aufsteigend)
fr: Nom de fichier (ascendant)

# file_sortBy.name_desc
source: File name (descending)
de: Dateiname (absteigend)
fr: Nom de fichier (descendant)

# file_sortBy.date_asc
source: Date (ascending)
de: Datum (aufsteigend)
fr: Date (ascendante)

# file_sortBy.date_desc
source: Date (descending)
de: Datum (absteigend)
fr: Date (descendante)

# file_sortBy.random
source: Random order
de: Zufällige Reihenfolge
fr: Ordre aléatoire

# file_sortBy.manual
source: Manual sorting
de: Manuelle Sortierung
fr: Ordre manuel
