Repository: MetaModels/attribute_file
Catalog: src/Resources/translations/*_metamodel_attribute.*.xlf
Languages: de, fr

# typeOptions.file
source: File
de: Datei
fr: Fichier

# file_customFiletree.label
source: Customize the file tree
de: Passen Sie den Dateibaum an
fr: Personnaliser l'arborescence

# file_customFiletree.description
source: Allows you to set custom options for the filetree.
de: Erlaubt Ihnen, individuelle Optionen für den Dateibaum zu setzen.
fr: Permet de personnaliser les options de l'arborescence.

# file_uploadFolder.label
source: Set file root folder
de: Wurzelordner (Root) angeben
fr: Spécifier le dossier racine

# file_uploadFolder.description
source: Selects the root point from which the user will select this file field.
de: Wählen Sie den Punkt im Dateibaum, von dem aus Benutzer Daten hinzufügen können.
fr: Sélectionne le point racine à partir duquel l'utilisateur sélectionnera ce champ de fichier.

# file_validFileTypes.label
source: Valid file types
de: Gültige Dateitypen
fr: Types de fichiers autorisés

# file_validFileTypes.description
source: To overwrite the contao standard file types, please enter a comma separated list of extensions of valid file types for this field.
de: Geben Sie hier eine kommagetrennte Liste gültiger Dateiendungen ein, um die Standard-Dateitypen von Contao zu überschreiben.
fr: Saisir une liste d'extensions de fichiers séparées par des virgules pour remplacer les types standards définis dans Contao.

# file_filesOnly.label
source: Allowed types for selection
de: Erlaubte Dateitypen
fr: Types autorisés à la sélection

# file_filesOnly.description
source: Select a restriction on files or folders - default is no restriction on files or folders.
de: Wählen Sie eine Einschränkung für Dateien oder Ordner aus - Standard ist keine Einschränkung für Dateien oder Ordner.
fr: Définir une restriction de fichiers ou de dossiers. Par défaut, pas de restriction.

# file_multiple.label
source: Multiple selection
de: Mehrfachauswahl
fr: Sélection multiple

# file_multiple.description
source: If selected, user will be able to select more than one item.
de: Wenn aktiviert, können mehrere Dateien ausgewählt werden.
fr: Si coché, l'utilisateur pourra sélectionner plusieurs éléments.

# file_filesOnly_options.allow_both
source: Allow files and folders
de: Erlauben von Dateien und Ordnern
fr: Autoriser fichiers et dossiers

# file_filesOnly_options.allow_files
source: Allow files only
de: Nur Dateien erlauben
fr: Autoriser seulement les fichiers

# file_filesOnly_options.allow_folder
source: Allow folders only
de: Nur Ordner erlauben
fr: Autoriser seulement les dossiers
